run/laserWeldSmall/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    massTransferMultiphaseSystem;

phases  (solid liquid gas);

solid 
{
    type            pureMovingPhaseModel;//pureStaticSolidPhaseModel;
}

liquid
{
    type            pureMovingPhaseModel;
}

gas
{
    type            pureMovingPhaseModel;
}

surfaceTension
(
    (gas and liquid)
    {
        type            constant;
        sigma           0.07;
    }
    (gas and solid)
    {
        type            constant;
        sigma           0.0;
    }
    (solid and liquid)
    {
        type            constant;
        sigma           0.0;
    }
);

interfacePorous
(
    (solid and liquid)
    {
        type            VollerPrakash;
        solidPhase      alpha.solid;
        Cu              0e12;
    }
);


massTransferModel
(
    (solid to liquid)
    {
        type            Lee;
        C               200;
        Tactivate       1710;
    }
    (liquid to solid)
    {
        type            Lee;
        C               -200;
        Tactivate       1710;
    }
);


// ************************************************************************* //
